import { Injectable, Service, signal } from '@angular/core';

@Service({
  autoProvided: true,
})
export class CounterService {
  constructor() {
    console.log('counterService created');
  }
  // 1:root
  //فقط یک نمونه برای کل پروژه
  //پشتیبانی کامل از Tree-shaking: اگر سرویس را در کدی inject یا ایمپورت نکنی، انگولار موقع بیلد (ng build) آن را کاملاً از باندل نهایی حذف می‌کند تا حجم برنامه کم شود.
  //طول عمر برابر با عمر اپلیکیشن: از لحظه اولین تزریق (inject) تا زمانی که تب مرورگر بسته یا رفرش شود در رم زنده می‌ماند و هرگز Destroy نمی‌شود.
  //ساخت Lazy (تنبل): تا زمانی که کامپوننت یا کدی به آن نیاز پیدا نکند، در رم new نمی‌شود.
  //اشتراک کامل بین Eager و Lazy: حتی روت‌ها یا ماژول‌های Lazy Load شده هم دقیقاً به همان تک نمونه دسترسی دارند و نمونه جدیدی نمی‌سازند.
  //عدم نیاز به تعریف در providers: نیازی نیست در آرایه providers فایل app.config.ts یا ماژول‌ها نوشته شود (کدنویسی تمیزتر و حذف خطای Circular Dependency).
  //مناسب برای Stateهای سراسری: بهترین جا برای سرویس‌های لاگین/Auth، استورها (SignalStore/NgRx)، کش دیتا و API Serviceها.

  public counter = signal(0);
  add() {
    this.counter.update((v) => v + 1);
  }

  //2any
  // برای هر Injector یک instance جداگانه ساخته می‌شود.

  //3:Platform
  //ساده‌ترین تعریف: providedIn: 'platform' یعنی اشتراک‌گذاری یک سرویس بین چندین اپلیکیشن انگولار که همزمان در یک صفحه وب اجرا شده‌اند.
  //در معماریِ میکروفرانت‌اند
  //تفاوت اساسی:
  // اگر سرویس root باشد:
  // هر اپلیکیشن برای خودش یک نسخه از سرویس می‌سازد. (۳ تا اپ = ۳ تا نمونه جداگانه). این‌ها هیچ ارتباطی با هم ندارند.
  //
  // اگر سرویس platform باشد:
  // همه اپلیکیشن‌ها به یک نمونه واحد (در سطح پلتفرمِ مرورگر) دسترسی دارند. (۳ تا اپ = ۱ نمونه مشترک).

  //4
  //این دکوراتور دقیقاً معادل @Injectable({ providedIn: 'root' }) است. نکاتی که باید بدانی:
  //Tree-shakable by Default: وقتی از @Service() استفاده می‌کنی، انگولار در زمان Build، اگر سرویس جایی استفاده نشده باشد، آن را از Bundle نهایی حذف می‌کند. این دقیقاً همان کاری است که در C# با تزریق وابستگی (Dependency Injection) در Program.cs انجام می‌دهی.
  // کجا استفاده نکنیم؟ اگر نیاز داری سرویس را در سطح یک Component خاص (نه سراسری) ایزوله کنی، یا از useClass برای پیاده‌سازی اینترفیس استفاده کنی، یا اسکوپ آن را platform بگذاری، اجباراً باید برگردی به همان @Injectable() سنتی. @Service() فقط برای تزریق سراسری (Root) طراحی شده است.
  // خوانایی (Readability): در پروژه‌های بزرگ Angular/Nx که تعداد سرویس‌ها زیاد است، حذف ({ providedIn: 'root' }) باعث می‌شود کدهای import و دکوراتور خیلی تمیزتر دیده شوند.

  //5
  // injectAsync;
  //قبلاً سرویس‌هایی که در root بودند (چه با @Injectable چه با @Service)، همیشه در main.js (باندل اصلی) قرار می‌گرفتند. اگر یک سرویس داشتی که از کتابخانه‌های سنگین (مثلاً PDF Generator، کتابخانه‌های رمزنگاری، یا نمودارهای حجیم) استفاده می‌کرد، کل پروژه سنگین می‌شد.
  // injectAsync به تو اجازه می‌دهد آن سرویس را به صورت Lazy Load (تنبلی) لود کنی.
  //const myHeavyService = injectAsync(() => import('./heavy.service'));
  //باندلینگ (Code Splitting): وقتی از import() در injectAsync استفاده می‌کنی، Webpack/Esbuild (و Nx) خودکار یک فایل .js جداگانه برای آن سرویس می‌سازد. تا زمانی که injectAsync صدا زده نشود، آن فایل در مرورگر دانلود نمی‌شود.
  // مکش (Memoization): انگولار هوشمند است. اولین باری که آن را صدا بزنی، سرویس دانلود و ساخته می‌شود. دفعات بعدی، انگولار همان نمونه (Instance) قبلی را برمی‌گرداند (همان رفتار Singleton).
  // سرویس حتماً باید providedIn: 'root' باشد: چون انگولار باید بداند چطور آن را بعد از لود شدن تزریق کند. @Service() جدید که با هم چک کردیم، بهترین دوست injectAsync است.
  // Prefetching (بارگذاری پیش‌دستانه): یکی از باحال‌ترین قابلیت‌های این API این است که می‌توانی به آن بگویی “اگر کاربر بیکار بود، دانلودش کن”:
}
